{

    "Backstory and Motivation": {
        "Detailed Background": "Dive deeper into a character's past, exploring their upbringing, significant life events, and the cultural or social environment that influenced them.",
        "Personal Drives and Desires": "Clarify what each character wants or strives for, whether it's personal goals, ideals, fears, or ambitions.",
        "Influential Relationships": "Detail important relationships that have shaped the character, such as mentors, rivals, loved ones, or adversaries."
    },
    "Character Arcs": {
        "Transformation Journey": "Map out the character's journey of change, showing how they evolve in response to story events and challenges.",
        "Milestones of Growth": "Identify key moments or events in the story that act as catalysts for the character’s growth or change.",
        "Resolution of Internal Conflicts": "Show how characters resolve their internal struggles and conflicts as part of their arc."
    },
    "Consistency and Complexity": {
        "Behavioral Patterns": "Establish patterns in the character’s behavior that align with their personality and history, ensuring they act believably within those parameters.",
        "Multidimensional Traits": "Develop layers to the character, such as conflicting desires, hidden fears, or unexpected strengths, to create depth.",
        "Dynamic Reactions": "Illustrate how the character reacts differently to various situations, showing a range of emotions and responses."
    },
    "Relatability": {
        "Universal Themes and Emotions": "Incorporate universal themes or emotions in the character's journey, such as love, loss, ambition, or redemption.",
        "Flaws and Vulnerabilities": "Give characters relatable flaws and vulnerabilities, making them more human and approachable.",
        "Aspirational Qualities": "Include aspirational or admirable qualities in characters, allowing readers to look up to them or draw inspiration from them."
    }
}
